In [ ]:
Create Student Table with ID as Primary Key and NOT NULL , Name as 20 Characters ,Age as Int value both are NOT NULL and
Address have  25 charter And Insert Any 5 Records?

In [ ]:
CREATE TABLE student
( Id int Primary Key,
  Name char(20) NOT NULL,
  Age int NOT NULL,
  Address char(25)
);
insert into student values(1,'abc',25,India)
insert into student values(2,'abc',25,India)
insert into student values(3,'abc',25,India)
insert into student values(4,'abc',25,India)
insert into student values(5,'abc',25,India)

In [ ]:
Write an SQL query to find the youngest student in the "student" table ?

In [ ]:
select name as youngestStudent, dob as dateOfBirth
from student
where dob = (select max(dob) from yourtable)

In [ ]:
Write an SQL query to retrieve the names and addresses of all persons from the "Person" table along with their 
corresponding addresses from the "Address" table.

In [ ]:
            SELECT names 

            FROM Person as p
            and
            addresses
            FROM Address as A

            WHERE P.PersonId =A.AddressId

In [ ]:
Write an SQL query to fetch the second highest number from the "student" table.?

In [ ]:
SELECT MAX marks 
FROM student 
WHERE marks NOT IN (SELECT Max (marks) 
                          FROM student);

In [ ]:
SQL Quary to get the nth highest salary from Employee table

In [ ]:
SELECT * FROM Employee WHERE sal = 
         (
            SELECT MIN(sal) FROM Employee 
            WHERE  sal IN (
            SELECT DISTINCT TOP N
            sal FROM Employee 
            ORDER BY sal DESC
))

In [ ]:
 Write a SQL query to find the median salary of each company.?

In [ ]:
WITH cte AS (
SELECT 
	id,
	company,
	Salary,
	ROW_NUMBER() OVER(PARTITION BY company ORDER BY Salary) as rn,
	COUNT(*) OVER(PARTITION BY company ) as rc 
FROM Employee
)

SELECT Id, company, salary 
FROM cte 
WHERE rn IN ( (rc+1 ) DIV 2 , (rc+2) DIV 2 )

In [ ]:
17.  Write a SQL to get the cumulative sum of an employeeâ€™s salary over a period of 3 month 
but exclude the most recent month? The result should be display by id ascending and then by month decending ?

In [ ]:
select e.Id, e.month, sum(e2.salary) as salary
from Employee e
join Employee e2
on (e.id = e2.id and e.month >= e2.month and (e.month - e2.month <= 2)) where e.month < (select max(month) from Employee 
where id = e.id) group by 1, 2 
order by 1, 2 desc;

In [ ]:
18.  Write the Query to find the Shortest Distance in Plane.

In [ ]:
SELECT 
MIN(ROUND(SQRT(POWER(p2.x - p1.x, 2) + POWER(p2.y - p1.y, 2)),2)) as shortest
FROM point_2d as p1 JOIN point_2d as p2
ON p1.x != p2.x OR  p1.y != p2.y

In [ ]:
19.  Consider a database with two tables: "Orders" and "Customers." Write an SQL query to retrieve the top 5 customers 
    who have made the most orders, along with the total count of their orders. Display the results in descending order 
    of the order count and ascending order of customer names.

In [ ]:
20.  Consider a database schema that represents an online bookstore with two tables: books and orders. The books 
    table has columns: book_id, title, author, price, and stock_quantity. The orders table has columns: order_id, 
    book_id, quantity, and order_date.Write an SQL query to find the top 3 bestselling products in terms of total 
    quantity sold, along with their names and total quantities sold.